---
kind: property
id: P:Autodesk.Revit.DB.ModelText.Text
source: html/a881285f-e5a5-d8de-612a-cd0e393934cf.htm
---
# Autodesk.Revit.DB.ModelText.Text Property

The text string in the model text.

## Syntax (C#)
```csharp
public string Text { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - Thrown when Nothing nullptr a null reference ( Nothing in Visual Basic) is assigned to text.
- **Autodesk.Revit.Exceptions.ArgumentException** - Thrown when an empty string is assigned to text.